# WallWidth

## Description
Function WallWidth returns the wall width of the referenced wall object.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION WallWidth(wallHd : HANDLE) : REAL;
```

```python

def vs.WallWidth(wallHd):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wallHd|HANDLE|Handle to wall.|

## See Also
VS Functions:
GetWallThickness| HWallWidth

## Version
Availability: from MiniCAD6.0
## Category
* Objects - Walls